
## Plan Result




<pre><code>Plan: 7 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;sn-assignment-group&#34;]
  * module.keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;sn-caller-id&#34;]
  * module.keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;sn-password&#34;]
  * module.keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;sn-role-type&#34;]
  * module.keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;sn-service-offering&#34;]
  * module.keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;sn-url&#34;]
  * module.keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;sn-username&#34;]
* Update
  * module.kv_hmi.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret["sn-assignment-group"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + content_type            = ""
      + expiration_date         = "2024-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg"
      + name                    = "sn-assignment-group"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "BuiltFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "application"         = "hearings-management-interface"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
          + "source"              = "bootstrap hmi-bootstrap-kv-stg secrets"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret["sn-caller-id"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + content_type            = ""
      + expiration_date         = "2024-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg"
      + name                    = "sn-caller-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "BuiltFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "application"         = "hearings-management-interface"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
          + "source"              = "bootstrap hmi-bootstrap-kv-stg secrets"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret["sn-password"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + content_type            = ""
      + expiration_date         = "2024-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg"
      + name                    = "sn-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "BuiltFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "application"         = "hearings-management-interface"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
          + "source"              = "bootstrap hmi-bootstrap-kv-stg secrets"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret["sn-role-type"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + content_type            = ""
      + expiration_date         = "2024-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg"
      + name                    = "sn-role-type"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "BuiltFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "application"         = "hearings-management-interface"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
          + "source"              = "bootstrap hmi-bootstrap-kv-stg secrets"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret["sn-service-offering"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + content_type            = ""
      + expiration_date         = "2024-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg"
      + name                    = "sn-service-offering"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "BuiltFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "application"         = "hearings-management-interface"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
          + "source"              = "bootstrap hmi-bootstrap-kv-stg secrets"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret["sn-url"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + content_type            = ""
      + expiration_date         = "2024-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg"
      + name                    = "sn-url"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "BuiltFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "application"         = "hearings-management-interface"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
          + "source"              = "bootstrap hmi-bootstrap-kv-stg secrets"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret["sn-username"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + content_type            = ""
      + expiration_date         = "2024-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg"
      + name                    = "sn-username"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "BuiltFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "application"         = "hearings-management-interface"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
          + "source"              = "bootstrap hmi-bootstrap-kv-stg secrets"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.kv_hmi.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg|hmi-kv-stg"
        name                       = "hmi-kv-stg"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 7 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":16,"Program":"tfcmt","SHA1":"","Vars":{}} -->